src/cf/src/Catalogs/ТелеграмСервис/ТелеграмСервис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмСервис</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ТелеграмСтатусыИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>Бот</name>
    <type>
      <types>CatalogRef.ТелеграмБоты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВходящегоОбновления</name>
    <type>
      <types>EnumRef.ТелеграмВидыВходящихОбновлений</types>
    </type>
  </attributes>
  <attributes>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВходящийТекстАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборыУсловийАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкиАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВходящийТекст</name>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВходящиеДанные</name>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыУсловий</name>
    <attributes>
      <name>НаборУсловий</name>
      <type>
        <types>CatalogRef.ТелеграмНаборУсловий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обработки</name>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.ТелеграмОбработка</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборУсловий</name>
      <type>
        <types>CatalogRef.ТелеграмНаборУсловий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Enums/ТелеграмВидыВходящихОбновлений/ТелеграмВидыВходящихОбновлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмВидыВходящихОбновлений</name>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>ОтветКонтекстнойКлавиатуры</name>
    <comment>CallbackQuery</comment>
  </enumValues>
  <enumValues>
    <name>ВстроенныйЗапрос</name>
  </enumValues>
  <enumValues>
    <name>ВыбранныйЛинейныйРезультат</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/ТелеграмСтатусыИспользования/ТелеграмСтатусыИспользования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмСтатусыИспользования</name>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>Выключен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ТелеграмНаборУсловий/ТелеграмНаборУсловий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмНаборУсловий</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КонтекстАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияАвто</name>
    <comment>Заполняется автоматически</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммнаяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контекст</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ТелеграмПараметрыКонтекста</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ТелеграмПараметрыКонтекста</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Условия</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ТелеграмПараметрыВходящегоСообщения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСравнения</name>
      <type>
        <types>EnumRef.ТелеграмВидыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ТелеграмПараметрыВходящегоСообщения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/ТелеграмСервис/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСервисыДляВыполнения(НакопленныеДанные) Экспорт
	
	Перем ВидСравнения;
	
	Ответ = Новый Массив;
	
	Сообщение 					= НакопленныеДанные.Сообщение;
	ИдентификаторЧата 			= НакопленныеДанные.ИдентификаторЧата;
	ВидВходящегоОбновления 		= НакопленныеДанные.ВидВходящегоОбновления;
	
	Если ВидВходящегоОбновления = Перечисления.ТелеграмВидыВходящихОбновлений.Сообщение Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаСравнения.Ссылка КАК Сервис,
		|	ТаблицаСравнения.Ссылка.Сортировка КАК Сортировка,
		|	ТаблицаСравнения.НомерСтроки КАК НомерСтроки,
		|	ТаблицаСравнения.ВидСравнения КАК ВидСравнения,
		|	ТаблицаСравнения.Значение КАК Значение
		|ИЗ
		|	Справочник.ТелеграмСервис.ВходящийТекст КАК ТаблицаСравнения
		|ГДЕ
		|	ТаблицаСравнения.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ТелеграмСтатусыИспользования.Используется)
		|	И ТаблицаСравнения.Ссылка.Бот = &Бот
		|	И ТаблицаСравнения.Ссылка.ВидВходящегоОбновления = &ВидВходящегоОбновления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сортировка";
		
		ЛевоеЗначение = НакопленныеДанные.ТекстСообщения;
		
	ИначеЕсли ВидВходящегоОбновления = Перечисления.ТелеграмВидыВходящихОбновлений.ОтветКонтекстнойКлавиатуры Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаСравнения.Ссылка КАК Сервис,
		|	ТаблицаСравнения.Ссылка.Сортировка КАК Сортировка,
		|	ТаблицаСравнения.НомерСтроки КАК НомерСтроки,
		|	ТаблицаСравнения.ВидСравнения КАК ВидСравнения,
		|	ТаблицаСравнения.Значение КАК Значение
		|ИЗ
		|	Справочник.ТелеграмСервис.ВходящиеДанные КАК ТаблицаСравнения
		|ГДЕ
		|	ТаблицаСравнения.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.ТелеграмСтатусыИспользования.Используется)
		|	И ТаблицаСравнения.Ссылка.Бот = &Бот
		|	И ТаблицаСравнения.Ссылка.ВидВходящегоОбновления = &ВидВходящегоОбновления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сортировка";
		
		ЛевоеЗначение = НакопленныеДанные.ОтветКонтекстнойКлавиатуры;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бот", НакопленныеДанные.ДанныеБота.Бот);
	Запрос.УстановитьПараметр("ВидВходящегоОбновления", ВидВходящегоОбновления);
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сервис 			= Выборка.Сервис;
		ВидСравнения 	= Выборка.ВидСравнения;
		ПравоеЗначение 	= Выборка.Значение;
		
		Если ТелеграмСервер.СравнениеИстинно(ЛевоеЗначение, ВидСравнения, ПравоеЗначение) Тогда
			Если Ответ.Найти(Сервис) = Неопределено Тогда
				Ответ.Добавить(Сервис);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Ответ = Справочники.ТелеграмНаборУсловий.ОтфильтрованныеСервисы(Ответ, НакопленныеДанные);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
